This is not accurate information about the books and is meant to serve as dummy data for testing purposes. I choose to format the data in JSON to make is easily readable.

[
    {
        "title": "To Kill a Mockingbird",
        "author" : {
            "firstName": "Harper",
            "lastName": "Lee"
        },
        "yearOfPublication": 1960,
        "numberOfPages": 336,
        "estimatedReadingTime": 6.5,
        "genre": "Classic",
        "rating": 5,
        "notes": "About the heroism of one man in the face of blind and violent hatred."
    },
    
    {
        "title": "Where the Sidewalk Ends",
        "author": {
            "firstName": "Shel",
            "lastName": "Silverstein"
        },
        "yearOfPublication": 1974,
        "numberOfPages": 176,
        "estimatedReadingTime": 3,
        "genre": "Poetry",
        "rating": 4
        
    },
    
    {
        "title": "Lord of the Rings",
        "author" : {
            "firstName": "J.R.R",
            "lastName": "Tolkien"
        },
        "yearOfPublication": 1960,
        "numberOfPages": 336,
        "estimatedReadingTime": 6.5,
        "genre": "Fantasy",
        "rating": 5,
        "notes": "This high-fantasy novel is a famous three volume epic. It centers around an all powerful ring forged by the Dark Lord Sauron. For many years the ring is sought after by all likes, but at the start of the novel, it resides in the simple home of the hobbit Bilbo Baggins. Bilbo sets a momentous quest upon his cousin Frodo’s shoulders, tasking him with the journey to Mount Doom to destroy the ring.Tolkein’s world-building is deep and rich. He creates languages in his stories that can even be learned by some of the more devoted readers. It’s not just a story that he’s crafting, but a home."
    },
    
    {
        "title": "Harry Potter and the Sorcerer's Stone",
        "author" : {
            "firstName": "J.K.",
            "lastName": "Rowling"
        },
        "yearOfPublication": 1997,
        "numberOfPages": 320,
        "estimatedReadingTime": 3.2,
        "genre": "Fantasy",
        "rating": 5,
        "notes": "The characters are truly the heart of this book. Harry doesn’t have to be the smartest of his friends in order to be a hero, and he doesn’t even have to be nice all the time. He’s a dynamic character who readers can relate to both as they age and as adults—it’s no wonder that Harry Potter is one of the most popular books of all time."
    },
    
    {
        "title": "And Then There Were None",
        "author" : {
            "firstName": "Agatha",
            "lastName": "Chistie"
        },
        "yearOfPublication": 2009,
        "numberOfPages": 258,
        "estimatedReadingTime": 2,
        "genre": "Mystery",
        "rating": 5
    },
    
    {
        "title": "Alice's Adventures in Wonderland",
        "author" : {
            "firstName": "Lewis",
            "lastName": "Carroll"
        },
        "yearOfPublication": 1960,
        "numberOfPages": 78,
        "estimatedReadingTime": 1,
        "genre": "Fantasy",
        "rating": 5
    },
    
    {
        "title": "The Lion, the Witch, and the Wardrobe",
        "author" : {
            "firstName": "C.S.",
            "lastName": "Lewis"
        },
        "yearOfPublication": 2008,
        "numberOfPages": 108,
        "estimatedReadingTime": 1.2,
        "genre": "Classic",
        "rating": 5
    },
    
    {
        "title": "Catcher in the Rye",
        "author" : {
            "firstName": "J.D.",
            "lastName": "Salinger"
        },
        "yearOfPublication": 2019,
        "numberOfPages": 134,
        "estimatedReadingTime": 2,
        "genre": "Fantasy",
        "rating": 5,
        "notes": "The hero-narrator of The Catcher in the Rye is an ancient child of sixteen, a native New Yorker named Holden Caufield. Through circumstances that tend to preclude adult, secondhand description, he leaves his prep school in Pennsylvania and goes underground in New York City for three days."
    },
    
    {
        "title": "Anne of Green Gables",
        "author" : {
            "firstName": "L.M.",
            "lastName": "Montgomery"
        },
        "yearOfPublication": 2019,
        "numberOfPages": 116,
        "estimatedReadingTime": 2,
        "genre": "Fiction",
        "rating": 4,
        "notes": "Sent to Green Gables farm by mistake, eleven-year-old orphan Anne Shirley prays that Matthew and Marilla Cuthbert will decide to keep her nevertheless. The middle-aged brother and sister wanted a boy to help around the farm; a skinny girl with bright red hair and a fiery personality to match is not at all what they need. But Anne’s quick wit and boundless imagination, developed over a lifetime spent in and out of orphanages, soon charm the Cuthberts and their Prince Edward Island friends and neighbors. The story of a special young girl finally finding her home, Anne of Green Gables is a masterpiece of children’s fiction and a true delight for readers of all ages."
    },
    
    {
        "title": "Twenty Thousand Leagues Under the Sea",
        "author" : {
            "firstName": "Jules",
            "lastName": "Verne"
        },
        "yearOfPublication": 2015,
        "numberOfPages": 259,
        "estimatedReadingTime": 2,
        "genre": "Fantasy",
        "rating": 5,
        "notes": "A monster has been wreaking havoc in the waters of the Atlantic Ocean. The US government has sent forth a team featuring Pierre Aronnax, a French marine biologist; Ned Land, a Canadian harpoonist; and Aronnax’s servant Conseil to take care of the problem. Their mission: Kill the beast. But what they find is the submarine Nautilus and its helmsman, the fearsome Captain Nemo."
    }
    
    {
        "title": "Java: How to Program, Early Objects (11th Edition)",
        "author" : {
            "firstName": "Harvey and Paul",
            "lastName": "Deitel"
        },
        "yearOfPublication": 2015,
        "numberOfPages": 2546,
        "estimatedReadingTime": 100,
        "genre": "Fantasy",
        "rating": 5,
        "notes": "I love this book. It's super informative and detailed. Every concept is illustrated with great examples to help the reader understand the content."
    }
]




